Art Share API/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
    def index
        artwork = Artwork.all

INSERT INTO "artworks" ("title", "artist_id") VALUES ($1, $2) RETURNING "id"  [["title", "Hello"], ["artist_id", 15]]
---
    def create
        artwork = Artwork.new(user_params)
        if artwork.save