Art Share API/app/controllers/users_controller.rb

    def create
        users = User.new(user_params)
        if users.save
---
INSERT INTO "users" ("username") VALUES ($1) RETURNING "id"  [["username", "John"]]